Balanceamento de carga/benchmark/cluster-server/#5 REQ-500 02122023 1049.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 30 --workers 9 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
1 connections
9 workers

Running 30s test @ http://localhost:3000
500 connections
9 workers

-
┌─────────┬───────┬─────────┬─────────┬─────────┬────────────┬───────────┬──────────┐
│ Stat    │ 2.5%  │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max      │
├─────────┼───────┼─────────┼─────────┼─────────┼────────────┼───────────┼──────────┤
│ Latency │ 88 ms │ 1000 ms │ 2051 ms │ 2237 ms │ 1003.03 ms │ 580.38 ms │ 10016 ms │
└─────────┴───────┴─────────┴─────────┴─────────┴────────────┴───────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 357     │ 357     │ 495     │ 558     │ 485.87  │ 40.46   │ 357     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 51.1 kB │ 51.1 kB │ 70.8 kB │ 79.8 kB │ 69.5 kB │ 5.78 kB │ 51.1 kB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 14576 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 270

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 6            │
├────────────┼──────────────┤
│ 1          │ 27           │
├────────────┼──────────────┤
│ 2.5        │ 88           │
├────────────┼──────────────┤
│ 10         │ 331          │
├────────────┼──────────────┤
│ 25         │ 628          │
├────────────┼──────────────┤
│ 50         │ 1000         │
├────────────┼──────────────┤
│ 75         │ 1305         │
├────────────┼──────────────┤
│ 90         │ 1647         │
├────────────┼──────────────┤
│ 97.5       │ 2051         │
├────────────┼──────────────┤
│ 99         │ 2237         │
├────────────┼──────────────┤
│ 99.9       │ 7046         │
├────────────┼──────────────┤
│ 99.99      │ 9164         │
├────────────┼──────────────┤
│ 99.999     │ 10016        │
└────────────┴──────────────┘

15k requests in 30.22s, 2.08 MB read