Balanceamento de carga/benchmark/cluster-server/#6 REQ-500 02122023 1107.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
500 connections
9 workers

/
┌─────────┬───────┬────────┬──────────┬──────────┬────────────┬───────────┬──────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%    │ 99%      │ Avg        │ Stdev     │ Max      │
├─────────┼───────┼────────┼──────────┼──────────┼────────────┼───────────┼──────────┤
│ Latency │ 15 ms │ 869 ms │ 17565 ms │ 21317 ms │ 1946.29 ms │ 4169.6 ms │ 56040 ms │
└─────────┴───────┴────────┴──────────┴──────────┴────────────┴───────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬───────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5% │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 375     │ 390     │ 473     │ 552   │ 472.63  │ 40.55  │ 375     │
├───────────┼─────────┼─────────┼─────────┼───────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 53.6 kB │ 55.8 kB │ 67.6 kB │ 79 kB │ 67.6 kB │ 5.8 kB │ 53.6 kB │
└───────────┴─────────┴─────────┴─────────┴───────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 28398 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 539

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 8            │
├────────────┼──────────────┤
│ 2.5        │ 15           │
├────────────┼──────────────┤
│ 10         │ 174          │
├────────────┼──────────────┤
│ 25         │ 492          │
├────────────┼──────────────┤
│ 50         │ 869          │
├────────────┼──────────────┤
│ 75         │ 1304         │
├────────────┼──────────────┤
│ 90         │ 2829         │
├────────────┼──────────────┤
│ 97.5       │ 17565        │
├────────────┼──────────────┤
│ 99         │ 21317        │
├────────────┼──────────────┤
│ 99.9       │ 37317        │
├────────────┼──────────────┤
│ 99.99      │ 55410        │
├────────────┼──────────────┤
│ 99.999     │ 56040        │
└────────────┴──────────────┘

31k requests in 60.34s, 4.06 MB read
2k errors (91 timeouts)