Balanceamento de carga/benchmark/cluster-server/#7 REQ-500 02122023 1109.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
500 connections
9 workers

-
┌─────────┬───────┬─────────┬──────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%  │ 50%     │ 97.5%    │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼───────┼─────────┼──────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 14 ms │ 1086 ms │ 22153 ms │ 26984 ms │ 2839.97 ms │ 5562.09 ms │ 55013 ms │
└─────────┴───────┴─────────┴──────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬───────┬─────────┬─────────┬─────────┬─────────┬─────────┬───────┐
│ Stat      │ 1%    │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min   │
├───────────┼───────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┤
│ Req/Sec   │ 294   │ 327     │ 449     │ 536     │ 446.45  │ 45.35   │ 294   │
├───────────┼───────┼─────────┼─────────┼─────────┼─────────┼─────────┼───────┤
│ Bytes/Sec │ 42 kB │ 46.8 kB │ 64.2 kB │ 76.7 kB │ 63.8 kB │ 6.48 kB │ 42 kB │
└───────────┴───────┴─────────┴─────────┴─────────┴─────────┴─────────┴───────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 26656 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 537

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 6            │
├────────────┼──────────────┤
│ 2.5        │ 14           │
├────────────┼──────────────┤
│ 10         │ 239          │
├────────────┼──────────────┤
│ 25         │ 632          │
├────────────┼──────────────┤
│ 50         │ 1086         │
├────────────┼──────────────┤
│ 75         │ 1651         │
├────────────┼──────────────┤
│ 90         │ 7382         │
├────────────┼──────────────┤
│ 97.5       │ 22153        │
├────────────┼──────────────┤
│ 99         │ 26984        │
├────────────┼──────────────┤
│ 99.9       │ 51402        │
├────────────┼──────────────┤
│ 99.99      │ 54979        │
├────────────┼──────────────┤
│ 99.999     │ 55013        │
└────────────┴──────────────┘

31k requests in 60.68s, 3.81 MB read
4k errors (112 timeouts)