Balanceamento de carga/benchmark/cluster-server/#8 REQ-500 02122023 1111.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
500 connections
9 workers

-
┌─────────┬──────┬─────────┬──────────┬──────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5% │ 50%     │ 97.5%    │ 99%      │ Avg       │ Stdev      │ Max      │
├─────────┼──────┼─────────┼──────────┼──────────┼───────────┼────────────┼──────────┤
│ Latency │ 7 ms │ 1121 ms │ 19483 ms │ 24115 ms │ 3101.8 ms │ 5298.14 ms │ 53574 ms │
└─────────┴──────┴─────────┴──────────┴──────────┴───────────┴────────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 424     │ 426     │ 509     │ 729    │ 524.58 │ 84.93   │ 424     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 60.6 kB │ 60.9 kB │ 72.8 kB │ 104 kB │ 75 kB  │ 12.1 kB │ 60.6 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 30950 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 531

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 7            │
├────────────┼──────────────┤
│ 10         │ 45           │
├────────────┼──────────────┤
│ 25         │ 430          │
├────────────┼──────────────┤
│ 50         │ 1121         │
├────────────┼──────────────┤
│ 75         │ 1977         │
├────────────┼──────────────┤
│ 90         │ 10639        │
├────────────┼──────────────┤
│ 97.5       │ 19483        │
├────────────┼──────────────┤
│ 99         │ 24115        │
├────────────┼──────────────┤
│ 99.9       │ 33362        │
├────────────┼──────────────┤
│ 99.99      │ 51234        │
├────────────┼──────────────┤
│ 99.999     │ 53574        │
└────────────┴──────────────┘

33k requests in 60.37s, 4.43 MB read
1k errors (21 timeouts)