Balanceamento de carga/benchmark/cluster-server/#9 REQ-500 02122023 1114.log
> cluster-api@1.0.0 test
> npx autocannon -c 500 -d 60 --workers 9 --renderStatusCodes --latency --warmup [ -c 25 -d 2 ] localhost:3000

Running 2s warmup @ http://localhost:3000
25 connections
9 workers

Running 60s test @ http://localhost:3000
500 connections
9 workers

-
┌─────────┬──────┬───────┬─────────┬─────────┬────────────┬───────────┬──────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max      │
├─────────┼──────┼───────┼─────────┼─────────┼────────────┼───────────┼──────────┤
│ Latency │ 5 ms │ 25 ms │ 5528 ms │ 7991 ms │ 1008.18 ms │ 1698.1 ms │ 19431 ms │
└─────────┴──────┴───────┴─────────┴─────────┴────────────┴───────────┴──────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 317     │ 423     │ 594     │ 888    │ 622.61  │ 196.54  │ 317     │
├───────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 45.5 kB │ 60.7 kB │ 85.3 kB │ 127 kB │ 89.4 kB │ 28.2 kB │ 45.5 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 32298 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 460

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 5            │
├────────────┼──────────────┤
│ 0.01       │ 5            │
├────────────┼──────────────┤
│ 0.1        │ 5            │
├────────────┼──────────────┤
│ 1          │ 5            │
├────────────┼──────────────┤
│ 2.5        │ 5            │
├────────────┼──────────────┤
│ 10         │ 5            │
├────────────┼──────────────┤
│ 25         │ 7            │
├────────────┼──────────────┤
│ 50         │ 25           │
├────────────┼──────────────┤
│ 75         │ 1425         │
├────────────┼──────────────┤
│ 90         │ 3071         │
├────────────┼──────────────┤
│ 97.5       │ 5528         │
├────────────┼──────────────┤
│ 99         │ 7991         │
├────────────┼──────────────┤
│ 99.9       │ 13472        │
├────────────┼──────────────┤
│ 99.99      │ 17558        │
├────────────┼──────────────┤
│ 99.999     │ 19431        │
└────────────┴──────────────┘

33k requests in 60.44s, 4.64 MB read
305 errors (144 timeouts)